---
kind: other
id: Methods.T:Autodesk.Revit.DB.SpatialElementCalculationPoint
source: html/bb11b88d-baf5-d164-18d9-ca59d09b3ed4.htm
---
# SpatialElementCalculationPoint Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.